In [ ]:
import pandas as pd
spending_df = pd.read_csv('spending_df.csv',index_col=0)
spending_df

    110年生活費  110年娛樂費  110年交通費  110年住宿費
一月     8000     3000     1000     8000
二月     7000     5000     1200     8000
三月     7500     4000     1200     8000

In [ ]:
# lab1-1
earning_df = pd.DataFrame({
        '110年薪資收入':[21000, 21000, 22000],
        '110年股票收入':[1000, 0 ,200]
        })
earning_df

   110年薪資收入  110年股票收入
0     21000      1000
1     21000         0
2     22000       200

In [ ]:
# lab1-1
rename_index = {0:'一月',1:'二月',2:'三月'}
earning_df = earning_df.rename(rename_index, axis=0)
earning_df

    110年薪資收入  110年股票收入
一月     21000      1000
二月     21000         0
三月     22000       200

In [ ]:
# lab1-1
property_df = pd.concat([spending_df,earning_df],axis=1)
property_df

    110年生活費  110年娛樂費  110年交通費  110年住宿費  110年薪資收入  110年股票收入
一月     8000     3000     1000     8000     21000      1000
二月     7000     5000     1200     8000     21000         0
三月     7500     4000     1200     8000     22000       200

In [ ]:
# lab1-2
spending_df[(spending_df['110年娛樂費']>=4000)|(spending_df['110年交通費']<1200)]

    110年生活費  110年娛樂費  110年交通費  110年住宿費
一月     8000     3000     1000     8000
二月     7000     5000     1200     8000
三月     7500     4000     1200     8000

In [ ]:
# lab1-3
spending_df['110年生活費']['二月']

7000

In [ ]:
# lab1-4
spending_df.loc['三月']

110年生活費    7500
110年娛樂費    4000
110年交通費    1200
110年住宿費    8000
Name: 三月, dtype: int64

In [ ]:
# lab1-5
spending_df['110年娛樂費'].max()

5000